In [1]:
# Load libraries 

import numpy as np
import pandas as pd

## Handling the missing data

In [2]:
float_data = pd.Series([1,4,2.,np.nan,2])
float_data

0    1.0
1    4.0
2    2.0
3    NaN
4    2.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [4]:
float_data = pd.Series([1,4,2.,np.nan,2, None, 'NULL', 'NA'])
float_data

0       1
1       4
2     2.0
3     NaN
4       2
5    None
6    NULL
7      NA
dtype: object

In [5]:
float_data.isna()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7    False
dtype: bool

### Filtering out missing data

In [6]:
float_data.dropna()
# float_data

0       1
1       4
2     2.0
4       2
6    NULL
7      NA
dtype: object

In [7]:
float_data[float_data.notna()]

0       1
1       4
2     2.0
4       2
6    NULL
7      NA
dtype: object

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
 ....: [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna() # If there is single NA in the row full row will be dropped.

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all') # If all are NA in row then it drop the row

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0 -0.213676  0.332820 -1.326192
1  0.310708  0.282648 -0.852311
2 -1.200154  0.267237 -1.411258
3  0.409755  0.162483  1.142089
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

In [12]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.213676       NaN       NaN
1  0.310708       NaN       NaN
2 -1.200154       NaN -1.411258
3  0.409755       NaN  1.142089
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

In [13]:
df.dropna()

          0         1         2
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

In [14]:
df.dropna( thresh=2)

          0         1         2
2 -1.200154       NaN -1.411258
3  0.409755       NaN  1.142089
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

### Filling in the missing data

In [15]:
df

          0         1         2
0 -0.213676       NaN       NaN
1  0.310708       NaN       NaN
2 -1.200154       NaN -1.411258
3  0.409755       NaN  1.142089
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

In [16]:
df.fillna(100.) # Fill with scaler value

          0           1           2
0 -0.213676  100.000000  100.000000
1  0.310708  100.000000  100.000000
2 -1.200154  100.000000   -1.411258
3  0.409755  100.000000    1.142089
4 -0.117912    0.240041   -0.669631
5  0.090934   -1.307774   -0.280719
6 -0.538319   -1.422395   -1.131446

In [17]:
df.fillna({1:0.5, 2:6}) # fillna with dictionary

          0         1         2
0 -0.213676  0.500000  6.000000
1  0.310708  0.500000  6.000000
2 -1.200154  0.500000 -1.411258
3  0.409755  0.500000  1.142089
4 -0.117912  0.240041 -0.669631
5  0.090934 -1.307774 -0.280719
6 -0.538319 -1.422395 -1.131446

In [18]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  0.284832 -2.411366 -0.192040
1  0.273781 -0.580197  0.346141
2  1.290316 -1.218968  0.166322
3 -0.291547 -2.071646  1.735479
4  1.055409  1.286446 -1.055060
5 -0.168407  1.424687  1.296858

In [19]:
df.iloc[4:,1] = np.nan
df.iloc[2:,2] = np.nan
df

          0         1         2
0  0.284832 -2.411366 -0.192040
1  0.273781 -0.580197  0.346141
2  1.290316 -1.218968       NaN
3 -0.291547 -2.071646       NaN
4  1.055409       NaN       NaN
5 -0.168407       NaN       NaN

In [20]:
df.fillna(method='ffill') # Fill forward

          0         1         2
0  0.284832 -2.411366 -0.192040
1  0.273781 -0.580197  0.346141
2  1.290316 -1.218968  0.346141
3 -0.291547 -2.071646  0.346141
4  1.055409 -2.071646  0.346141
5 -0.168407 -2.071646  0.346141

In [21]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.284832 -2.411366 -0.192040
1  0.273781 -0.580197  0.346141
2  1.290316 -1.218968  0.346141
3 -0.291547 -2.071646  0.346141
4  1.055409 -2.071646       NaN
5 -0.168407 -2.071646       NaN

In [22]:
df.fillna(df.mean()) # fill with mean

          0         1         2
0  0.284832 -2.411366 -0.192040
1  0.273781 -0.580197  0.346141
2  1.290316 -1.218968  0.077051
3 -0.291547 -2.071646  0.077051
4  1.055409 -1.570545  0.077051
5 -0.168407 -1.570545  0.077051

In [23]:
df.mean()

0    0.407397
1   -1.570545
2    0.077051
dtype: float64

## Data Transformation

In [25]:
## Removing duplicates 
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [29]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(subset=['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data using a Functions or Mappings

In [33]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
 ....: "pastrami", "corned beef", "bacon",
 ....: "pastrami", "honey ham", "nova lox"],
 ....: "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}

In [35]:
def f(x):
    return meat_to_animal[x]

In [38]:
data['animal'] = data['food'].map(f)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## replacing Values

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999,10)

0       1.0
1      10.0
2       2.0
3      10.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999:100,-1000:np.nan})

0      1.0
1    100.0
2      2.0
3    100.0
4      NaN
5      3.0
dtype: float64

In [ ]:
232